/*++

Copyright (c) 1999-2002  Microsoft Corporation

Module Name:

    scanner.c

Abstract:

    This is the main module of the scanner filter.

    This filter scans the data in a file before allowing an open to proceed.  This is similar
    to what virus checkers do.

Environment:

    Kernel mode

--*/
#pragma warning (disable : 4995)
#pragma warning (disable : 4702)
#include <fltKernel.h>
#include <dontuse.h>
#include <suppress.h>
#include "scanuk.h"
#include "scanner.h"
#include <stdlib.h>
#include <mbstring.h>
#include <ntstrsafe.h>
#include <wdm.h>



#pragma prefast(disable:__WARNING_ENCODE_MEMBER_FUNCTION_POINTER, "Not valid for kernel mode drivers")

#define SCANNER_REG_TAG       'Rncs'
#define SCANNER_STRING_TAG    'Sncs'

//
//  Structure that contains all the global data structures
//  used throughout the scanner.
//

SCANNER_DATA ScannerData;

//
//  This is a static list of file name extensions files we are interested in scanning
//

PUNICODE_STRING ScannedExtensions;
ULONG ScannedExtensionCount;



//
//  The default extension to scan if not configured in the registry
//

UNICODE_STRING ScannedExtensionDefault = RTL_CONSTANT_STRING(L"doc");
LONGLONG reservedN = 0;
//BOOLEAN bOpen = FALSE;
//PFLT_FILE_NAME_INFORMATION m_gnameInfo = NULL;
//
//  Function prototypes
//

NTSTATUS
ScannerInitializeScannedExtensions(
    _In_ PUNICODE_STRING RegistryPath
);

VOID
ScannerFreeExtensions(
);

NTSTATUS
ScannerAllocateUnicodeString(
    _Inout_ PUNICODE_STRING String

    //reservedN = FltObjects->FileObject->FileName.Length;







    if (FlagOn(Data->Iopb->Parameters.Create.Options, FILE_DELETE_ON_CLOSE))
    {

        reservedN = -255;

    }

    FltReleaseFileNameInformation(nameInfo);



    //
    //  See if this create is being done by our user process.
    //

    if (IoThreadToProcess( Data->Thread ) == ScannerData.UserProcess) {

       // DbgPrint( "!!! scanner.sys -- allowing create for trusted process \n" );

        return FLT_PREOP_SUCCESS_NO_CALLBACK;
    }

    return FLT_PREOP_SUCCESS_WITH_CALLBACK;*/
}


BOOLEAN
ScannerpCheckExtension(
    _In_ PUNICODE_STRING Extension
)
/*++

Routine Description:

    Checks if this file name extension is something we are interested in

Arguments

    Extension - Pointer to the file name extension

Return Value

    TRUE - Yes we are interested
    FALSE - No
--*/
{
    ULONG count;

    if (Extension->Length == 0) {

        return FALSE;
    }

    //
    //  Check if it matches any one of our static extension list
    //

    for (count = 0; count < ScannedExtensionCount; count++) {

        if (RtlCompareUnicodeString(Extension, ScannedExtensions + count, TRUE) == 0) {

            //
            //  A match. We are interested in this file
            //

            return TRUE;
        }
    }

    return FALSE;
}

HANDLE GetFileHandle(IN PCWSTR FileName, IN ACCESS_MASK DesiredAccess, IN ULONG ShareAccess)
{
    NTSTATUS ntStatus;
    UNICODE_STRING uniFileName;
    OBJECT_ATTRIBUTES objectAttributes;
    HANDLE ntFileHandle;
    IO_STATUS_BLOCK ioStatus;

    if (KeGetCurrentIrql() > PASSIVE_LEVEL)
    {
        DbgPrint("KeGetCurrentIrql() > PASSIVE_LEVEL \n");
        return 0;
    }

    RtlInitUnicodeString(&uniFileName, FileName);

    InitializeObjectAttributes(&objectAttributes, &uniFileName, OBJ_KERNEL_HANDLE | OBJ_CASE_INSENSITIVE, NULL, NULL);

    ntStatus = IoCreateFile(&ntFileHandle, DesiredAccess, &objectAttributes, &ioStatus, 0, FILE_ATTRIBUTE_NORMAL, ShareAccess, FILE_OPEN, 0, NULL, 0, 0, NULL, IO_NO_PARAMETER_CHECKING);

    if (!NT_SUCCESS(ntStatus))
    {
        DbgPrint("IoCreateFile() error - 0x%X \n", ntStatus);
        return 0;
    }

    return ntFileHandle;
}

NTSTATUS GetExistanceStatus(PUNICODE_STRING puPath, PIO_STATUS_BLOCK
    pIoStatus)
{
    //	DBGASSERTIRQLEQUAL(PASSIVE_LEVEL);

    NTSTATUS status;
    OBJECT_ATTRIBUTES aFileAttrib;
    FILE_NETWORK_OPEN_INFORMATION aInfo;

#if (WINVER>=0x500)

    InitializeObjectAttributes(&aFileAttrib, puPath,
        OBJ_CASE_INSENSITIVE | OBJ_KERNEL_HANDLE, NULL, NULL);

#else

    InitializeObjectAttributes(&aFileAttrib, puPath,
        OBJ_CASE_INSENSITIVE, NULL, NULL);

#endif

    //
    // Use FastOpen (if possible). If not that call will roll
    // create IRP.
    //

    status = IoFastQueryNetworkAttributes(&aFileAttrib, SYNCHRONIZE, 0,
        pIoStatus, &aInfo);

    if (NT_SUCCESS(status))
    {
        status = pIoStatus->Status;
    }

    return status;
}

#pragma warning (disable : 4201)
typedef struct _OBJECT_SYMBOLIC_LINK
{
    /* 0x0000 */ union _LARGE_INTEGER CreationTime;
    union
    {
        /* 0x0008 */ struct _UNICODE_STRING LinkTarget;
        struct
        {
            /* 0x0008 */ void* Callback /* function */;
            /* 0x0010 */ void* CallbackContext;
        }; /* size: 0x0010 */
    }; /* size: 0x0010 */
    /* 0x0018 */ unsigned long DosDeviceDriveIndex;
    /* 0x001c */ unsigned long Flags;
    /* 0x0020 */ unsigned long AccessMask;
    /* 0x0024 */ long __PADDING__[1];
} OBJECT_SYMBOLIC_LINK, * POBJECT_SYMBOLIC_LINK; /* size: 0x0028 */


FLT_POSTOP_CALLBACK_STATUS
ScannerPostCreate(
    _Inout_ PFLT_CALLBACK_DATA Data,
    _In_ PCFLT_RELATED_OBJECTS FltObjects,
    _In_opt_ PVOID CompletionContext,
    _In_ FLT_POST_OPERATION_FLAGS Flags
)
/*++

Routine Description:

    Post create callback.  We can't scan the file until after the create has
    gone to the filesystem, since otherwise the filesystem wouldn't be ready
    to read the file for us.

Arguments:

    Data - The structure which describes the operation parameters.

    FltObject - The structure which describes the objects affected by this
        operation.

    CompletionContext - The operation context passed fron the pre-create
        callback.

    Flags - Flags to say why we are getting this post-operation callback.

Return Value:

    FLT_POSTOP_FINISHED_PROCESSING - ok to open the file or we wish to deny
